apache/nuttx/arch/arm/src/stm32f3/hardware/stm32f33xxx_hrtim.h
/* Master Timer Counter Register */

#define HRTIM_MCNTR_SHIFT          0 /* Bits 0-15: Counter Value */
#define HRTIM_MCNTR_MASK           (0xffff << HRTIM_MCNTR_SHIFT)

/* Master Timer Period Register */

#define HRTIM_MPER_SHIFT           0 /* Bits 0-15: Master Timer Period value */
#define HRTIM_MPER_MASK            (0xffff << HRTIM_MPER_SHIFT)

/* Master Timer Repetition Register */

#define HRTIM_MREP_SHIFT           0 /* Bits 0-8: Master Timer Repetition period value */
#define HRTIM_MREP_MASK            (0xff << HRTIM_MREP_SHIFT)

/* Master Timer Compare 1 Register */

#define HRTIM_MCMP1_SHIFT           0 /* Bits 0-15: Master Timer Compare 1 value */
#define HRTIM_MCMP1_MASK            (0xffff << HRTIM_MCMP1_SHIFT)

/* Master Timer Compare 2 Register */

#define HRTIM_MCMP2_SHIFT           0 /* Bits 0-15: Master Timer Compare 2 value */
#define HRTIM_MCMP2_MASK            (0xffff << HRTIM_MCMP2_SHIFT)

/* Master Timer Compare 3 Register */

#define HRTIM_MCMP3_SHIFT           0 /* Bits 0-15: Master Timer Compare 3 value  */
#define HRTIM_MCMP3_MASK            (0xffff << HRTIM_MCMP3_SHIFT)

/* Master Timer Compare 4 Register */

#define HRTIM_MCMP4_SHIFT           0 /* Bits 0-15: Master Timer Compare 4 value  */
#define HRTIM_MCMP4_MASK            (0xffff << HRTIM_MCMP4_SHIFT)

/* Timer A-E Control Register */

#define HRTIM_TIMCR_PSHPLL          (1 << 6)                         /* Bit 6:Push-Pull mode enable */
                                                                     /* Bits 10-11 common */
#define HRTIM_TIMCR_DELCMP2_SHIFT   12                               /* Bits 12-13: CMP2 auto-delayed mode */
#define HRTIM_TIMCR_DELCMP2_MASK    (3 << HRTIM_TIMCR_DELCMP2_SHIFT)
#  define HRTIM_TIMCR_DELCMP2_00    (0 << HRTIM_TIMCR_DELCMP2_SHIFT) /* 00: */
#  define HRTIM_TIMCR_DELCMP2_01    (1 << HRTIM_TIMCR_DELCMP2_SHIFT) /* 01: */
#  define HRTIM_TIMCR_DELCMP2_10    (2 << HRTIM_TIMCR_DELCMP2_SHIFT) /* 10: */
#  define HRTIM_TIMCR_DELCMP2_11    (3 << HRTIM_TIMCR_DELCMP2_SHIFT) /* 11: */
#define HRTIM_TIMCR_DELCMP4_SHIFT   12                               /* Bits 14-15: CMP4 auto-delayed mode */
#define HRTIM_TIMCR_DELCMP4_MASK    (3 << HRTIM_TIMCR_DELCMP4_SHIFT)
#  define HRTIM_TIMCR_DELCMP4_00    (0 << HRTIM_TIMCR_DELCMP4_SHIFT) /* 00: */
#  define HRTIM_TIMCR_DELCMP4_01    (1 << HRTIM_TIMCR_DELCMP4_SHIFT) /* 01: */
#  define HRTIM_TIMCR_DELCMP4_10    (2 << HRTIM_TIMCR_DELCMP4_SHIFT) /* 10: */
#  define HRTIM_TIMCR_DELCMP4_11    (3 << HRTIM_TIMCR_DELCMP4_SHIFT) /* 11: */
#define HRTIM_TIMCR_REPU            (1 << 17)                        /* Bit 17: Timer X Repetition Update */
#define HRTIM_TIMCR_RSTU            (1 << 18)                        /* Bit 18: Timer X Reset Update */
#define HRTIM_TIMCR_TAU             (1 << 19)                        /* Bit 19: Timer A Update */
#define HRTIM_TIMCR_TBU             (1 << 20)                        /* Bit 20: Timer B Update */
#define HRTIM_TIMCR_TCU             (1 << 21)                        /* Bit 21: Timer C Update */
#define HRTIM_TIMCR_TDU             (1 << 22)                        /* Bit 22: Timer D Update */
#define HRTIM_TIMCR_TEU             (1 << 23)                        /* Bit 23: Timer E Update */
#define HRTIM_TIMCR_MSTU            (1 << 24)                        /* Bit 24: Master Timer Update */
                                                                     /* Bits 25-27 common */
#define HRTIM_TIMCR_UPDGAT_SHIFT    28                               /* Bits 28-31: Update Gating */
#define HRTIM_TIMCR_UPDGAT_MASK     (15 << HRTIM_TIMCR_UPDGAT_SHIFT)
#  define HRTIM_TIMCR_UPDGAT_0000   (0 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0000: */
#  define HRTIM_TIMCR_UPDGAT_0001   (1 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0001: */
#  define HRTIM_TIMCR_UPDGAT_0010   (2 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0010: */
#  define HRTIM_TIMCR_UPDGAT_0011   (3 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0011: */
#  define HRTIM_TIMCR_UPDGAT_0100   (4 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0100: */
#  define HRTIM_TIMCR_UPDGAT_0101   (5 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0101: */
#  define HRTIM_TIMCR_UPDGAT_0110   (6 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0110: */
#  define HRTIM_TIMCR_UPDGAT_0111   (7 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0111: */
#  define HRTIM_TIMCR_UPDGAT_1000   (8 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 1000: */

/* Timer X Interrupt Status Register */

#define HRTIM_TIMISR_CMP1           (1 << 0)  /* Bit 0: Compare 1 Interrupt Flag */
#define HRTIM_TIMISR_CMP2           (1 << 1)  /* Bit 1: Compare 2 Interrupt Flag */
#define HRTIM_TIMISR_CMP3           (1 << 2)  /* Bit 2: Compare 3 Interrupt Flag */
#define HRTIM_TIMISR_CMP4           (1 << 3)  /* Bit 3: Compare 4 Interrupt Flag */
#define HRTIM_TIMISR_REP            (1 << 4)  /* Bit 4: Repetition Interrupt Flag */
#define HRTIM_TIMISR_UPD            (1 << 6)  /* Bit 6: Update Interrupt Flag */
#define HRTIM_TIMISR_CPT1           (1 << 7)  /* Bit 7: Capture 1 Interrupt Flag */
#define HRTIM_TIMISR_CPT2           (1 << 8)  /* Bit 8: Capture 2 Interrupt Flag */
#define HRTIM_TIMISR_SET1           (1 << 9)  /* Bit 9: Output 1 Set Interrupt Flag */
#define HRTIM_TIMISR_RST1           (1 << 10) /* Bit 10: Output 1 Reset Interrupt Flag  */
#define HRTIM_TIMISR_SET2           (1 << 11) /* Bit 11: Output 2 Set Interrupt Flag  */
#define HRTIM_TIMISR_RST2           (1 << 12) /* Bit 12: Output 2 Reset Interrupt Flag  */
#define HRTIM_TIMISR_RST            (1 << 13) /* Bit 13: Reset and/or roll-over Interrupt Flag  */
#define HRTIM_TIMISR_DLYPRT         (1 << 14) /* Bit 14: Delayed Protection Flag */
#define HRTIM_TIMISR_CPPSTAT        (1 << 16) /* Bit 16: Current Push Pull Status */
#define HRTIM_TIMISR_IPPSTAT        (1 << 17) /* Bit 17: Idle Push Pull Status */
#define HRTIM_TIMISR_O1STAT         (1 << 18) /* Bit 18: Output 1 Status */
#define HRTIM_TIMISR_O2STAT         (1 << 19) /* Bit 19: Output 2 Status */
#define HRTIM_TIMISR_O1CPY          (1 << 20) /* Bit 20: Output 1 Copy */
#define HRTIM_TIMISR_O2CPY          (1 << 21) /* Bit 21: Output 2 Copy */

