apache/nuttx/arch/arm/src/stm32f3/hardware/stm32f33xxx_hrtim.h
/* Timer X Reset Register */

#define HRTIM_TIMARST_UPDT            (1 << 1)  /* Bit 1 */
#define HRTIM_TIMARST_CMP2            (1 << 2)  /* Bit 2 */
#define HRTIM_TIMARST_CMP4            (1 << 3)  /* Bit 3 */
#define HRTIM_TIMARST_MSTPER          (1 << 4)  /* Bit 4 */
#define HRTIM_TIMARST_MSTCMP1         (1 << 5)  /* Bit 5 */
#define HRTIM_TIMARST_MSTCMP2         (1 << 6)  /* Bit 6 */
#define HRTIM_TIMARST_MSTCMP3         (1 << 7)  /* Bit 7 */
#define HRTIM_TIMARST_MSTCMP4         (1 << 8)  /* Bit 8 */
#define HRTIM_TIMARST_EXTEVNT1        (1 << 9)  /* Bit 9 */
#define HRTIM_TIMARST_EXTEVNT2        (1 << 10) /* Bit 10 */
#define HRTIM_TIMARST_EXTEVNT3        (1 << 11) /* Bit 11 */
#define HRTIM_TIMARST_EXTEVNT4        (1 << 12) /* Bit 12 */
#define HRTIM_TIMARST_EXTEVNT5        (1 << 13) /* Bit 13 */
#define HRTIM_TIMARST_EXTEVNT6        (1 << 14) /* Bit 14 */
#define HRTIM_TIMARST_EXTEVNT7        (1 << 15) /* Bit 15 */
#define HRTIM_TIMARST_EXTEVNT8        (1 << 16) /* Bit 16 */
#define HRTIM_TIMARST_EXTEVNT9        (1 << 17) /* Bit 17 */
#define HRTIM_TIMARST_EXTEVNT10       (1 << 18) /* Bit 18 */
#define HRTIM_TIMARST_TIMBCMP1        (1 << 19) /* Bit 19 */
#define HRTIM_TIMARST_TIMBCMP2        (1 << 20) /* Bit 20 */
#define HRTIM_TIMARST_TIMBCMP4        (1 << 21) /* Bit 21 */
#define HRTIM_TIMARST_TIMCCMP1        (1 << 22) /* Bit 22 */
#define HRTIM_TIMARST_TIMCCMP2        (1 << 23) /* Bit 23 */
#define HRTIM_TIMARST_TIMCCMP4        (1 << 24) /* Bit 24 */
#define HRTIM_TIMARST_TIMDCMP1        (1 << 25) /* Bit 25 */
#define HRTIM_TIMARST_TIMDCMP2        (1 << 26) /* Bit 26 */
#define HRTIM_TIMARST_TIMDCMP4        (1 << 27) /* Bit 27 */
#define HRTIM_TIMARST_TIMECMP1        (1 << 28) /* Bit 28 */
#define HRTIM_TIMARST_TIMECMP2        (1 << 29) /* Bit 29 */
#define HRTIM_TIMARST_TIMECMP4        (1 << 30) /* Bit 30 */

#define HRTIM_TIMBRST_UPDT            (1 << 1)  /* Bit 1 */
#define HRTIM_TIMBRST_CMP2            (1 << 2)  /* Bit 2 */
#define HRTIM_TIMBRST_CMP4            (1 << 3)  /* Bit 3 */
#define HRTIM_TIMBRST_MSTPER          (1 << 4)  /* Bit 4 */
#define HRTIM_TIMBRST_MSTCMP1         (1 << 5)  /* Bit 5 */
#define HRTIM_TIMBRST_MSTCMP2         (1 << 6)  /* Bit 6 */
#define HRTIM_TIMBRST_MSTCMP3         (1 << 7)  /* Bit 7 */
#define HRTIM_TIMBRST_MSTCMP4         (1 << 8)  /* Bit 8 */
#define HRTIM_TIMBRST_EXTEVNT1        (1 << 9)  /* Bit 9 */
#define HRTIM_TIMBRST_EXTEVNT2        (1 << 10) /* Bit 10 */
#define HRTIM_TIMBRST_EXTEVNT3        (1 << 11) /* Bit 11 */
#define HRTIM_TIMBRST_EXTEVNT4        (1 << 12) /* Bit 12 */
#define HRTIM_TIMBRST_EXTEVNT5        (1 << 13) /* Bit 13 */
#define HRTIM_TIMBRST_EXTEVNT6        (1 << 14) /* Bit 14 */
#define HRTIM_TIMBRST_EXTEVNT7        (1 << 15) /* Bit 15 */
#define HRTIM_TIMBRST_EXTEVNT8        (1 << 16) /* Bit 16 */
#define HRTIM_TIMBRST_EXTEVNT9        (1 << 17) /* Bit 17 */
#define HRTIM_TIMBRST_EXTEVNT10       (1 << 18) /* Bit 18 */
#define HRTIM_TIMBRST_TIMACMP1        (1 << 19) /* Bit 19 */
#define HRTIM_TIMBRST_TIMACMP2        (1 << 20) /* Bit 20 */
#define HRTIM_TIMBRST_TIMACMP4        (1 << 21) /* Bit 21 */
#define HRTIM_TIMBRST_TIMCCMP1        (1 << 22) /* Bit 22 */
#define HRTIM_TIMBRST_TIMCCMP2        (1 << 23) /* Bit 23 */
#define HRTIM_TIMBRST_TIMCCMP4        (1 << 24) /* Bit 24 */
#define HRTIM_TIMBRST_TIMDCMP1        (1 << 25) /* Bit 25 */
#define HRTIM_TIMBRST_TIMDCMP2        (1 << 26) /* Bit 26 */
#define HRTIM_TIMBRST_TIMDCMP4        (1 << 27) /* Bit 27 */
#define HRTIM_TIMBRST_TIMECMP1        (1 << 28) /* Bit 28 */
#define HRTIM_TIMBRST_TIMECMP2        (1 << 29) /* Bit 29 */
#define HRTIM_TIMBRST_TIMECMP4        (1 << 30) /* Bit 30 */

#define HRTIM_TIMCRST_UPDT            (1 << 1)  /* Bit 1 */
#define HRTIM_TIMCRST_CMP2            (1 << 2)  /* Bit 2 */
#define HRTIM_TIMCRST_CMP4            (1 << 3)  /* Bit 3 */
#define HRTIM_TIMCRST_MSTPER          (1 << 4)  /* Bit 4 */
#define HRTIM_TIMCRST_MSTCMP1         (1 << 5)  /* Bit 5 */
#define HRTIM_TIMCRST_MSTCMP2         (1 << 6)  /* Bit 6 */
#define HRTIM_TIMCRST_MSTCMP3         (1 << 7)  /* Bit 7 */
#define HRTIM_TIMCRST_MSTCMP4         (1 << 8)  /* Bit 8 */
#define HRTIM_TIMCRST_EXTEVNT1        (1 << 9)  /* Bit 9 */
#define HRTIM_TIMCRST_EXTEVNT2        (1 << 10) /* Bit 10 */
#define HRTIM_TIMCRST_EXTEVNT3        (1 << 11) /* Bit 11 */
#define HRTIM_TIMCRST_EXTEVNT4        (1 << 12) /* Bit 12 */
#define HRTIM_TIMCRST_EXTEVNT5        (1 << 13) /* Bit 13 */
#define HRTIM_TIMCRST_EXTEVNT6        (1 << 14) /* Bit 14 */
#define HRTIM_TIMCRST_EXTEVNT7        (1 << 15) /* Bit 15 */
#define HRTIM_TIMCRST_EXTEVNT8        (1 << 16) /* Bit 16 */
#define HRTIM_TIMCRST_EXTEVNT9        (1 << 17) /* Bit 17 */
#define HRTIM_TIMCRST_EXTEVNT10       (1 << 18) /* Bit 18 */
#define HRTIM_TIMCRST_TIMACMP1        (1 << 19) /* Bit 19 */
#define HRTIM_TIMCRST_TIMACMP2        (1 << 20) /* Bit 20 */
#define HRTIM_TIMCRST_TIMACMP4        (1 << 21) /* Bit 21 */
#define HRTIM_TIMCRST_TIMBCMP1        (1 << 22) /* Bit 22 */
#define HRTIM_TIMCRST_TIMBCMP2        (1 << 23) /* Bit 23 */
#define HRTIM_TIMCRST_TIMBCMP4        (1 << 24) /* Bit 24 */
#define HRTIM_TIMCRST_TIMDCMP1        (1 << 25) /* Bit 25 */
#define HRTIM_TIMCRST_TIMDCMP2        (1 << 26) /* Bit 26 */
#define HRTIM_TIMCRST_TIMDCMP4        (1 << 27) /* Bit 27 */
#define HRTIM_TIMCRST_TIMECMP1        (1 << 28) /* Bit 28 */
#define HRTIM_TIMCRST_TIMECMP2        (1 << 29) /* Bit 29 */
#define HRTIM_TIMCRST_TIMECMP4        (1 << 30) /* Bit 30 */

#define HRTIM_TIMDRST_UPDT            (1 << 1)  /* Bit 1 */
#define HRTIM_TIMDRST_CMP2            (1 << 2)  /* Bit 2 */
#define HRTIM_TIMDRST_CMP4            (1 << 3)  /* Bit 3 */
#define HRTIM_TIMDRST_MSTPER          (1 << 4)  /* Bit 4 */
#define HRTIM_TIMDRST_MSTCMP1         (1 << 5)  /* Bit 5 */
#define HRTIM_TIMDRST_MSTCMP2         (1 << 6)  /* Bit 6 */
#define HRTIM_TIMDRST_MSTCMP3         (1 << 7)  /* Bit 7 */
#define HRTIM_TIMDRST_MSTCMP4         (1 << 8)  /* Bit 8 */
#define HRTIM_TIMDRST_EXTEVNT1        (1 << 9)  /* Bit 9 */
#define HRTIM_TIMDRST_EXTEVNT2        (1 << 10) /* Bit 10 */
#define HRTIM_TIMDRST_EXTEVNT3        (1 << 11) /* Bit 11 */
#define HRTIM_TIMDRST_EXTEVNT4        (1 << 12) /* Bit 12 */
#define HRTIM_TIMDRST_EXTEVNT5        (1 << 13) /* Bit 13 */
#define HRTIM_TIMDRST_EXTEVNT6        (1 << 14) /* Bit 14 */
#define HRTIM_TIMDRST_EXTEVNT7        (1 << 15) /* Bit 15 */
#define HRTIM_TIMDRST_EXTEVNT8        (1 << 16) /* Bit 16 */
#define HRTIM_TIMDRST_EXTEVNT9        (1 << 17) /* Bit 17 */
#define HRTIM_TIMDRST_EXTEVNT10       (1 << 18) /* Bit 18 */
#define HRTIM_TIMDRST_TIMACMP1        (1 << 19) /* Bit 19 */
#define HRTIM_TIMDRST_TIMACMP2        (1 << 20) /* Bit 20 */
#define HRTIM_TIMDRST_TIMACMP4        (1 << 21) /* Bit 21 */
#define HRTIM_TIMDRST_TIMBCMP1        (1 << 22) /* Bit 22 */
#define HRTIM_TIMDRST_TIMBCMP2        (1 << 23) /* Bit 23 */
#define HRTIM_TIMDRST_TIMBCMP4        (1 << 24) /* Bit 24 */
#define HRTIM_TIMDRST_TIMCCMP1        (1 << 25) /* Bit 25 */
#define HRTIM_TIMDRST_TIMCCMP2        (1 << 26) /* Bit 26 */
#define HRTIM_TIMDRST_TIMCCMP4        (1 << 27) /* Bit 27 */
#define HRTIM_TIMDRST_TIMECMP1        (1 << 28) /* Bit 28 */
#define HRTIM_TIMDRST_TIMECMP2        (1 << 29) /* Bit 29 */
#define HRTIM_TIMDRST_TIMECMP4        (1 << 30) /* Bit 30 */

#define HRTIM_TIMERST_UPDT            (1 << 1)  /* Bit 1 */
#define HRTIM_TIMERST_CMP2            (1 << 2)  /* Bit 2 */
#define HRTIM_TIMERST_CMP4            (1 << 3)  /* Bit 3 */
#define HRTIM_TIMERST_MSTPER          (1 << 4)  /* Bit 4 */
#define HRTIM_TIMERST_MSTCMP1         (1 << 5)  /* Bit 5 */
#define HRTIM_TIMERST_MSTCMP2         (1 << 6)  /* Bit 6 */
#define HRTIM_TIMERST_MSTCMP3         (1 << 7)  /* Bit 7 */
#define HRTIM_TIMERST_MSTCMP4         (1 << 8)  /* Bit 8 */
#define HRTIM_TIMERST_EXTEVNT1        (1 << 9)  /* Bit 9 */
#define HRTIM_TIMERST_EXTEVNT2        (1 << 10) /* Bit 10 */
#define HRTIM_TIMERST_EXTEVNT3        (1 << 11) /* Bit 11 */
#define HRTIM_TIMERST_EXTEVNT4        (1 << 12) /* Bit 12 */
#define HRTIM_TIMERST_EXTEVNT5        (1 << 13) /* Bit 13 */
#define HRTIM_TIMERST_EXTEVNT6        (1 << 14) /* Bit 14 */
#define HRTIM_TIMERST_EXTEVNT7        (1 << 15) /* Bit 15 */
#define HRTIM_TIMERST_EXTEVNT8        (1 << 16) /* Bit 16 */
#define HRTIM_TIMERST_EXTEVNT9        (1 << 17) /* Bit 17 */
#define HRTIM_TIMERST_EXTEVNT10       (1 << 18) /* Bit 18 */
#define HRTIM_TIMERST_TIMACMP1        (1 << 19) /* Bit 19 */
#define HRTIM_TIMERST_TIMACMP2        (1 << 20) /* Bit 20 */
#define HRTIM_TIMERST_TIMACMP4        (1 << 21) /* Bit 21 */
#define HRTIM_TIMERST_TIMBCMP1        (1 << 22) /* Bit 22 */
#define HRTIM_TIMERST_TIMBCMP2        (1 << 23) /* Bit 23 */
#define HRTIM_TIMERST_TIMBCMP4        (1 << 24) /* Bit 24 */
#define HRTIM_TIMERST_TIMCCMP1        (1 << 25) /* Bit 25 */
#define HRTIM_TIMERST_TIMCCMP2        (1 << 26) /* Bit 26 */
#define HRTIM_TIMERST_TIMCCMP4        (1 << 27) /* Bit 27 */
#define HRTIM_TIMERST_TIMDCMP1        (1 << 28) /* Bit 28 */
#define HRTIM_TIMERST_TIMDCMP2        (1 << 29) /* Bit 29 */
#define HRTIM_TIMERST_TIMDCMP4        (1 << 30) /* Bit 30 */

/* Timer X Chopper Register */

#define HRTIM_TIMCHP_CARFRQ_SHIFT     0 /* Bits 0-3: Chopper carrier frequency */
#define HRTIM_TIMCHP_CARFRQ_MASK      (15 << HRTIM_TIMCHP_CARFRQ_SHIFT)

#define HRTIM_TIMCHP_CARDTY_SHIFT     4 /* Bits 4-6: Chopper duty cycle */
#define HRTIM_TIMCHP_CARDTY_MASK      (7 << HRTIM_TIMCHP_CARDTY_SHIFT)

