apache/nuttx/arch/arm/src/stm32f3/hardware/stm32f33xxx_hrtim.h
#define HRTIM_TIMCHP_STRTPW_SHIFT     7 /* Bits 7-10: Chopper start pulsewidth */
#define HRTIM_TIMCHP_STRTPW_MASK      (15 << HRTIM_TIMCHP_STRTPW_SHIFT)

/* Timer X Capture 12 Control Register */

#define HRTIM_TIMCPT12CR_SWCPT        (1 << 0)
#define HRTIM_TIMCPT12CR_UPDCPT       (1 << 1)
#define HRTIM_TIMCPT12CR_EXEV1CPT     (1 << 2)
#define HRTIM_TIMCPT12CR_EXEV2CPT     (1 << 3)
#define HRTIM_TIMCPT12CR_EXEV3CPT     (1 << 4)
#define HRTIM_TIMCPT12CR_EXEV4CPT     (1 << 5)
#define HRTIM_TIMCPT12CR_EXEV5CPT     (1 << 6)
#define HRTIM_TIMCPT12CR_EXEV6CPT     (1 << 7)
#define HRTIM_TIMCPT12CR_EXEV7CPT     (1 << 8)
#define HRTIM_TIMCPT12CR_EXEV8CPT     (1 << 9)
#define HRTIM_TIMCPT12CR_EXEV9CPT     (1 << 10)
#define HRTIM_TIMCPT12CR_EXEV10CPT    (1 << 11)
#define HRTIM_TIMCPT12CR_TA1SET       (1 << 12)
#define HRTIM_TIMCPT12CR_TA1RST       (1 << 13)
#define HRTIM_TIMCPT12CR_TACMP1       (1 << 14)
#define HRTIM_TIMCPT12CR_TACMP2       (1 << 15)
#define HRTIM_TIMCPT12CR_TB1SET       (1 << 16)
#define HRTIM_TIMCPT12CR_TB1RST       (1 << 17)
#define HRTIM_TIMCPT12CR_TBCMP1       (1 << 18)
#define HRTIM_TIMCPT12CR_TBCMP2       (1 << 19)
#define HRTIM_TIMCPT12CR_TC1SET       (1 << 20)
#define HRTIM_TIMCPT12CR_TC1RST       (1 << 21)
#define HRTIM_TIMCPT12CR_TCCMP1       (1 << 22)
#define HRTIM_TIMCPT12CR_TCCMP2       (1 << 23)
#define HRTIM_TIMCPT12CR_TD1SET       (1 << 24)
#define HRTIM_TIMCPT12CR_TD1RST       (1 << 25)
#define HRTIM_TIMCPT12CR_TDCMP1       (1 << 26)
#define HRTIM_TIMCPT12CR_TDCMP2       (1 << 27)
#define HRTIM_TIMCPT12CR_TE1SET       (1 << 28)
#define HRTIM_TIMCPT12CR_TE1RST       (1 << 29)
#define HRTIM_TIMCPT12CR_TECMP1       (1 << 30)
#define HRTIM_TIMCPT12CR_TECMP2       (1 << 31)

/* Timer X Output Register */

#define HRTIM_TIMOUT_POL1              (1 << 1)                         /* Bit 1: Output 1 polarity */
#define HRTIM_TIMOUT_IDLEM1            (1 << 2)                         /* Bit 2: Output 1 IDLE mode */
#define HRTIM_TIMOUT_IDLES1            (1 << 3)                         /* Bit 3: Output 1 IDLE state*/
#define HRTIM_TIMOUT_FAULT1_SHIFT      4                                /* Bit 4-5: Output 1 Fault state */
#define HRTIM_TIMOUT_FAULT1_MASK       (3 << HRTIM_TIMOUT_FAULT1_SHIFT)
#  define HRTIM_TIMOUT_FAULT1_0        (0 << HRTIM_TIMOUT_FAULT1_SHIFT) /* 00: No action */
#  define HRTIM_TIMOUT_FAULT1_1        (1 << HRTIM_TIMOUT_FAULT1_SHIFT) /* 01: Active */
#  define HRTIM_TIMOUT_FAULT1_2        (2 << HRTIM_TIMOUT_FAULT1_SHIFT) /* 10: Inactive */
#  define HRTIM_TIMOUT_FAULT1_3        (3 << HRTIM_TIMOUT_FAULT1_SHIFT) /* 11: High-Z */
#define HRTIM_TIMOUT_CHP1              (1 << 6)                         /* Bit 6: Output 1 Chopper enable */
#define HRTIM_TIMOUT_DIDL1             (1 << 7)                         /* Bit 7: Output 1 Deadtime upon burst mode IDLE entry */
#define HRTIM_TIMOUT_DTEN              (1 << 8)                         /* Bit 8: Deadtime enable */
#define HRTIM_TIMOUT_DLYPRTEN          (1 << 9)                         /* Bit 9: Delayed Protection enable */
#define HRTIM_TIMOUT_DLYPRT_SHIFT      10                               /* Bits 10-12: Delayed Protection*/
#define HRTIM_TIMOUT_DLYPRT_MASK       (3 << HRTIM_TIMOUT_DLYPRT_SHIFT)
#  define HRTIM_TIMOUT_DLYPRT_0        (0 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 000: */
#  define HRTIM_TIMOUT_DLYPRT_1        (1 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 001: */
#  define HRTIM_TIMOUT_DLYPRT_2        (2 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 010: */
#  define HRTIM_TIMOUT_DLYPRT_3        (3 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 011: */
#  define HRTIM_TIMOUT_DLYPRT_4        (4 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 100: */
#  define HRTIM_TIMOUT_DLYPRT_5        (5 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 101: */
#  define HRTIM_TIMOUT_DLYPRT_6        (6 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 110: */
#  define HRTIM_TIMOUT_DLYPRT_7        (7 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 111: */
                                                                        /* Bit 12-16: Resered  */
#define HRTIM_TIMOUT_POL2             (1 << 17)                         /* Bit 17: Output 2 polarity */
#define HRTIM_TIMOUT_IDLEM2           (1 << 18)                         /* Bit 18: Output 2 IDLE mode */
#define HRTIM_TIMOUT_IDLES2           (1 << 19)                         /* Bit 19: Output 2 IDLE state */
#define HRTIM_TIMOUT_FAULT2_SHIFT     20                                /* Bit 20-21: Output 2 Fault state */
#define HRTIM_TIMOUT_FAULT2_MASK      (3 << HRTIM_TIMOUT_FAULT2_SHIFT)
#  define HRTIM_TIMOUT_FAULT2_0       (0 << HRTIM_TIMOUT_FAULT2_SHIFT)  /* 00: No action*/
#  define HRTIM_TIMOUT_FAULT2_1       (1 << HRTIM_TIMOUT_FAULT2_SHIFT)  /* 01: Active */
#  define HRTIM_TIMOUT_FAULT2_2       (2 << HRTIM_TIMOUT_FAULT2_SHIFT)  /* 10: Inactive */
#  define HRTIM_TIMOUT_FAULT2_3       (3 << HRTIM_TIMOUT_FAULT2_SHIFT)  /* 11: High-Z*/
#define HRTIM_TIMOUT_CHP2             (1 << 22)                         /* Bit 22: Output 2 Chopper enable */
#define HRTIM_TIMOUT_DIDL2            (1 << 23)                         /* Bit 23: Output 2 Deadtime upon burst mode IDLE entry */

/* Timer X Fault Register */

#define HRTIM_TIMFLT_FLT1EN           (1 << 0)  /* Bit 0: Fault1 enable */
#define HRTIM_TIMFLT_FLT2EN           (1 << 1)  /* Bit 1: Fault 2 enable */
#define HRTIM_TIMFLT_FLT3EN           (1 << 2)  /* Bit 2: Fault 3 enable*/
#define HRTIM_TIMFLT_FLT4EN           (1 << 3)  /* Bit 3: Fault 4 enable */
#define HRTIM_TIMFLT_FLT5EN           (1 << 4)  /* Bit 4: Fault 5 enable */
#define HRTIM_TIMFLT_FLTLCK           (1 << 31) /* Bit 31: Fault sources lock*/

/* Common Control Register 1 */

#define HRTIM_CR1_MUDIS               (1 << 0) /* Bit 0: Master Update Disable */
#define HRTIM_CR1_TAUDIS              (1 << 1) /* Bit 1: Timer A Update Disable */
#define HRTIM_CR1_TBUDIS              (1 << 2) /* Bit 2: Timer B Update Disable */
#define HRTIM_CR1_TCUDIS              (1 << 3) /* Bit 3: Timer C Update Disable */
#define HRTIM_CR1_TDUDIS              (1 << 4) /* Bit 4: Timer D Update Disable */
#define HRTIM_CR1_TEUDIS              (1 << 5) /* Bit 5: Timer E Update Disable */
#define HRTIM_CR1_AD1USRC_SHIFT       16       /* Bits 16-18: ADC Trigger 1 Update Source  */
#define HRTIM_CR1_AD1USRC_MASK        (7 << HRTIM_CR1_AD1USRC_SHIFT)
#  define HRTIM_CR1_AD1USRC_MT        (0 << HRTIM_CR1_AD1USRC_SHIFT) /* 000: Master Timer */
#  define HRTIM_CR1_AD1USRC_TA        (1 << HRTIM_CR1_AD1USRC_SHIFT) /* 001: Timer A */
#  define HRTIM_CR1_AD1USRC_TB        (2 << HRTIM_CR1_AD1USRC_SHIFT) /* 010: Timer B */
#  define HRTIM_CR1_AD1USRC_TC        (3 << HRTIM_CR1_AD1USRC_SHIFT) /* 011: Timer C */
#  define HRTIM_CR1_AD1USRC_TD        (4 << HRTIM_CR1_AD1USRC_SHIFT) /* 100: Timer D */
#  define HRTIM_CR1_AD1USRC_TE        (5 << HRTIM_CR1_AD1USRC_SHIFT) /* 101: Timer A */
#define HRTIM_CR1_AD2USRC_SHIFT       19                             /* Bits 19-21: ADC Trigger 2 Update Source  */
#define HRTIM_CR1_AD2USRC_MASK        (7 << HRTIM_CR1_AD2USRC_SHIFT)
#  define HRTIM_CR1_AD2USRC_MT        (0 << HRTIM_CR1_AD2USRC_SHIFT) /* 000: Master Timer */
#  define HRTIM_CR1_AD2USRC_TA        (1 << HRTIM_CR1_AD2USRC_SHIFT) /* 001: Timer A */
#  define HRTIM_CR1_AD2USRC_TB        (2 << HRTIM_CR1_AD2USRC_SHIFT) /* 010: Timer B */
#  define HRTIM_CR1_AD2USRC_TC        (3 << HRTIM_CR1_AD2USRC_SHIFT) /* 011: Timer C */
#  define HRTIM_CR1_AD2USRC_TD        (4 << HRTIM_CR1_AD2USRC_SHIFT) /* 100: Timer D */
#  define HRTIM_CR1_AD2USRC_TE        (5 << HRTIM_CR1_AD2USRC_SHIFT) /* 101: Timer A */
#define HRTIM_CR1_AD3USRC_SHIFT       22                             /* Bits 22-24: ADC Trigger 3 Update Source  */
#define HRTIM_CR1_AD3USRC_MASK        (7 << HRTIM_CR1_AD3USRC_SHIFT)
#  define HRTIM_CR1_AD3USRC_MT        (0 << HRTIM_CR1_AD3USRC_SHIFT) /* 000: Master Timer */
#  define HRTIM_CR1_AD3USRC_TA        (1 << HRTIM_CR1_AD3USRC_SHIFT) /* 001: Timer A */
#  define HRTIM_CR1_AD3USRC_TB        (2 << HRTIM_CR1_AD3USRC_SHIFT) /* 010: Timer B */
#  define HRTIM_CR1_AD3USRC_TC        (3 << HRTIM_CR1_AD3USRC_SHIFT) /* 011: Timer C */
#  define HRTIM_CR1_AD3USRC_TD        (4 << HRTIM_CR1_AD3USRC_SHIFT) /* 100: Timer D */
#  define HRTIM_CR1_AD3USRC_TE        (5 << HRTIM_CR1_AD3USRC_SHIFT) /* 101: Timer A */
#define HRTIM_CR1_AD4USRC_SHIFT       25                             /* Bits 25-27: ADC Trigger 4 Update Source  */
#define HRTIM_CR1_AD4USRC_MASK        (7 << HRTIM_CR1_AD4USRC_SHIFT)
#  define HRTIM_CR1_AD4USRC_MT        (0 << HRTIM_CR1_AD4USRC_SHIFT) /* 000: Master Timer */
#  define HRTIM_CR1_AD4USRC_TA        (1 << HRTIM_CR1_AD4USRC_SHIFT) /* 001: Timer A */
#  define HRTIM_CR1_AD4USRC_TB        (2 << HRTIM_CR1_AD4USRC_SHIFT) /* 010: Timer B */
#  define HRTIM_CR1_AD4USRC_TC        (3 << HRTIM_CR1_AD4USRC_SHIFT) /* 011: Timer C */
#  define HRTIM_CR1_AD4USRC_TD        (4 << HRTIM_CR1_AD4USRC_SHIFT) /* 100: Timer D */
#  define HRTIM_CR1_AD4USRC_TE        (5 << HRTIM_CR1_AD4USRC_SHIFT) /* 101: Timer A */

/* Common Control Register 2 */

#define HRTIM_CR2_MSWU                (1 << 0)  /* Bit 0: Master Timer Software Update */
#define HRTIM_CR2_TASWU               (1 << 1)  /* Bit 1: Timer A Software Update */
#define HRTIM_CR2_TBSWU               (1 << 2)  /* Bit 2: Timer B Software Update */
#define HRTIM_CR2_TCSWU               (1 << 3)  /* Bit 3: Timer C Software Update */
#define HRTIM_CR2_TDSWU               (1 << 4)  /* Bit 4: Timer D Software Update */
#define HRTIM_CR2_TESWU               (1 << 5)  /* Bit 5: Timer E Software Update */
#define HRTIM_CR2_MRST                (1 << 8)  /* Bit 8: Master Counter Software Reset*/
#define HRTIM_CR2_TARST               (1 << 9)  /* Bit 9: Timer A Counter Software Reset*/
#define HRTIM_CR2_TBRST               (1 << 10) /* Bit 10: Timer B Counter Software Reset*/
#define HRTIM_CR2_TCRST               (1 << 11) /* Bit 11: Timer C Counter Software Reset*/
#define HRTIM_CR2_TDRST               (1 << 12) /* Bit 12: Timer D Counter Software Reset*/
#define HRTIM_CR2_TERST               (1 << 13) /* Bit 13: Timer E Counter Software Reset*/

