apache/nuttx/arch/arm/src/stm32f3/hardware/stm32f33xxx_hrtim.h
/* Common Interrupt Status Register */

#define HRTIM_ISR_FLT1                (1 << 0)  /* Bit 0: Fault 1 Interrupt Flag */
#define HRTIM_ISR_FLT2                (1 << 1)  /* Bit 1: Fault 2 Interrupt Flag */
#define HRTIM_ISR_FLT3                (1 << 2)  /* Bit 2: Fault 3 Interrupt Flag */
#define HRTIM_ISR_FLT4                (1 << 3)  /* Bit 3: Fault 4 Interrupt Flag */
#define HRTIM_ISR_FLT5                (1 << 4)  /* Bit 4: Fault 5 Interrupt Flag */
#define HRTIM_ISR_SYSFLT              (1 << 5)  /* Bit 5: System Fault Interrupt Flag */
#define HRTIM_ISR_DLLRDY              (1 << 16) /* Bit 16: DLL Ready Interrupt Flag */
#define HRTIM_ISR_BMPER               (1 << 17) /* Bit 17: Burst mode Period Interrupt Flag */

/* Common Interrupt Clear Register */

#define HRTIM_ICR_FLT1C                (1 << 0)  /* Bit 0: Fault 1 Interrupt Flag Clear */
#define HRTIM_ICR_FLT2C                (1 << 1)  /* Bit 1: Fault 2 Interrupt Flag Clear */
#define HRTIM_ICR_FLT3C                (1 << 2)  /* Bit 2: Fault 3 Interrupt Flag Clear */
#define HRTIM_ICR_FLT4C                (1 << 3)  /* Bit 3: Fault 4 Interrupt Flag Clear */
#define HRTIM_ICR_FLT5C                (1 << 4)  /* Bit 4: Fault 5 Interrupt Flag Clear */
#define HRTIM_ICR_SYSFLTC              (1 << 5)  /* Bit 5: System Fault Interrupt Flag Clear */
#define HRTIM_ICR_DLLRDYC              (1 << 16) /* Bit 16: DLL Ready Interrupt Flag Clear */
#define HRTIM_ICR_BMPERC               (1 << 17) /* Bit 17: Burst mode Period Interrupt Flag Clear */

/* Common Interrupt Enable Register */

#define HRTIM_IER_FLT1IE               (1 << 0)  /* Bit 0: Fault 1 Interrupt Enable */
#define HRTIM_IER_FLT2IE               (1 << 1)  /* Bit 1: Fault 2 Interrupt Enable */
#define HRTIM_IER_FLT3IE               (1 << 2)  /* Bit 2: Fault 3 Interrupt Enable */
#define HRTIM_IER_FLT4IE               (1 << 3)  /* Bit 3: Fault 4 Interrupt Enable */
#define HRTIM_IER_FLT5IE               (1 << 4)  /* Bit 4: Fault 5 Interrupt Enable */
#define HRTIM_IER_SYSFLTIE             (1 << 5)  /* Bit 5: System Fault Interrupt Enable */
#define HRTIM_IER_DLLRDYIE             (1 << 16) /* Bit 16: DLL Ready Interrupt Enable */
#define HRTIM_IER_BMPERIE              (1 << 17) /* Bit 17: Burst mode Period Interrupt Enable */

/* Common Output Enable Register */

#define HRTIM_OENR_TA1OE                (1 << 0) /* Bit 0: Timer A Output 1 Enable */
#define HRTIM_OENR_TA2OE                (1 << 1) /* Bit 1: Timer A Output 2 Enable */
#define HRTIM_OENR_TB1OE                (1 << 2) /* Bit 2: Timer B Output 1 Enable */
#define HRTIM_OENR_TB2OE                (1 << 3) /* Bit 3: Timer B Output 2 Enable */
#define HRTIM_OENR_TC1OE                (1 << 4) /* Bit 4: Timer C Output 1 Enable */
#define HRTIM_OENR_TC2OE                (1 << 5) /* Bit 5: Timer C Output 2 Enable */
#define HRTIM_OENR_TD1OE                (1 << 6) /* Bit 6: Timer D Output 1 Enable */
#define HRTIM_OENR_TD2OE                (1 << 7) /* Bit 7: Timer D Output 2 Enable */
#define HRTIM_OENR_TE1OE                (1 << 8) /* Bit 8: Timer E Output 1 Enable */
#define HRTIM_OENR_TE2OE                (1 << 9) /* Bit 9: Timer E Output 2 Enable */

/* Common Output Disable Register */

#define HRTIM_ODISR_TA1ODIS             (1 << 0) /* Bit 0: Timer A Output 1 Disable */
#define HRTIM_ODISR_TA2ODIS             (1 << 1) /* Bit 1: Timer A Output 2 Disable */
#define HRTIM_ODISR_TB1ODIS             (1 << 2) /* Bit 2: Timer B Output 1 Disable */
#define HRTIM_ODISR_TB2ODIS             (1 << 3) /* Bit 3: Timer B Output 2 Disable */
#define HRTIM_ODISR_TC1ODIS             (1 << 4) /* Bit 4: Timer C Output 1 Disable */
#define HRTIM_ODISR_TC2ODIS             (1 << 5) /* Bit 5: Timer C Output 2 Disable */
#define HRTIM_ODISR_TD1ODIS             (1 << 6) /* Bit 6: Timer D Output 1 Disable */
#define HRTIM_ODISR_TD2ODIS             (1 << 7) /* Bit 7: Timer D Output 2 Disable */
#define HRTIM_ODISR_TE1ODIS             (1 << 8) /* Bit 8: Timer E Output 1 Disable */
#define HRTIM_ODISR_TE2ODIS             (1 << 9) /* Bit 9: Timer E Output 2 Disable */

/* Common Output Disable Status Register */

#define HRTIM_ODSR_TA1ODS               (1 << 0) /* Bit 0: Timer A Output 1 Disable Status */
#define HRTIM_ODSR_TA2ODS               (1 << 1) /* Bit 1: Timer A Output 2 Disable Status */
#define HRTIM_ODSR_TB1ODS               (1 << 2) /* Bit 2: Timer B Output 1 Disable Status */
#define HRTIM_ODSR_TB2ODS               (1 << 3) /* Bit 3: Timer B Output 2 Disable Status */
#define HRTIM_ODSR_TC1ODS               (1 << 4) /* Bit 4: Timer C Output 1 Disable Status */
#define HRTIM_ODSR_TC2ODS               (1 << 5) /* Bit 5: Timer C Output 2 Disable Status */
#define HRTIM_ODSR_TD1ODS               (1 << 6) /* Bit 6: Timer D Output 1 Disable Status */
#define HRTIM_ODSR_TD2ODS               (1 << 7) /* Bit 7: Timer D Output 2 Disable Status */
#define HRTIM_ODSR_TE1ODS               (1 << 8) /* Bit 8: Timer E Output 1 Disable Status */
#define HRTIM_ODSR_TE2ODS               (1 << 9) /* Bit 9: Timer E Output 2 Disable Status */

/* Common Burst Mode Control Register */

#define HRTIM_BMCR_BME                  (1 << 0) /* Bit 0: Burst Mode Enable */
#define HRTIM_BMCR_BMOM                 (1 << 1) /* Bit 1: Burst Mode Operating Mode */
#define HRTIM_BMCR_BMCLK_SHIFT          2        /* Bits 2-5: Burst Mode Clock Source */
#define HRTIM_BMCR_BMCLK_MASK           (15 << HRTIM_BMCR_BMCLK_SHIFT)
#  define HRTIM_BMCR_BMCLK_0            (0 << HRTIM_BMCR_BMCLK_SHIFT)  /* 0000: Master Timer Counter Reset/roll-over */
#  define HRTIM_BMCR_BMCLK_1            (1 << HRTIM_BMCR_BMCLK_SHIFT)  /* 0001: Timer A counter reset/roll-over */
#  define HRTIM_BMCR_BMCLK_2            (2 << HRTIM_BMCR_BMCLK_SHIFT)  /* 0010: Timer B counter reset/roll-over */
#  define HRTIM_BMCR_BMCLK_3            (3 << HRTIM_BMCR_BMCLK_SHIFT)  /* 0011: Timer C counter reset/roll-over */
#  define HRTIM_BMCR_BMCLK_4            (4 << HRTIM_BMCR_BMCLK_SHIFT)  /* 0100: Timer D counter reset/roll-over */
#  define HRTIM_BMCR_BMCLK_5            (5 << HRTIM_BMCR_BMCLK_SHIFT)  /* 0101: Timer E counter reset/roll-over */
#  define HRTIM_BMCR_BMCLK_6            (6 << HRTIM_BMCR_BMCLK_SHIFT)  /* 0110: On-chip Event 1 acting as a burst mode counter clock  */
#  define HRTIM_BMCR_BMCLK_7            (7 << HRTIM_BMCR_BMCLK_SHIFT)  /* 0111: On-chip Event 2 acting as a burst mode counter clock  */
#  define HRTIM_BMCR_BMCLK_8            (8 << HRTIM_BMCR_BMCLK_SHIFT)  /* 1000: On-chip Event 3 acting as a burst mode counter clock  */
#  define HRTIM_BMCR_BMCLK_9            (9 << HRTIM_BMCR_BMCLK_SHIFT)  /* 1001: On-chip Event 4 acting as a burst mode counter clock  */
#  define HRTIM_BMCR_BMCLK_10           (10 << HRTIM_BMCR_BMCLK_SHIFT) /* 1010: Prescaled fHRTIM clock */
#define HRTIM_BMCR_BMPRSC_SHIFT         6                              /* Bits 6-9: Burst Mode Prescaler */
#define HRTIM_BMCR_BMPRSC_MASK          (15 << HRTIM_BMCR_BMPRSC_SHIFT)
#  define HRTIM_BMCR_BMPRSC_PSCOFF      (0 << HRTIM_BMCR_BMPRSC_SHIFT)  /* 0000: Clock not divided */
#  define HRTIM_BMCR_BMPRSC_d2          (1 << HRTIM_BMCR_BMPRSC_SHIFT)  /* 0001: Division by 2 */
#  define HRTIM_BMCR_BMPRSC_d4          (2 << HRTIM_BMCR_BMPRSC_SHIFT)  /* 0010: Division by 4 */
#  define HRTIM_BMCR_BMPRSC_d8          (3 << HRTIM_BMCR_BMPRSC_SHIFT)  /* 0011: Division by 8 */
#  define HRTIM_BMCR_BMPRSC_d16         (4 << HRTIM_BMCR_BMPRSC_SHIFT)  /* 0100: Division by 16 */
#  define HRTIM_BMCR_BMPRSC_d32         (5 << HRTIM_BMCR_BMPRSC_SHIFT)  /* 0101: Division by 32 */
#  define HRTIM_BMCR_BMPRSC_d64         (6 << HRTIM_BMCR_BMPRSC_SHIFT)  /* 0110: Division by 64 */
#  define HRTIM_BMCR_BMPRSC_d128        (7 << HRTIM_BMCR_BMPRSC_SHIFT)  /* 0111: Division by 128 */
#  define HRTIM_BMCR_BMPRSC_d256        (8 << HRTIM_BMCR_BMPRSC_SHIFT)  /* 1000: Division by 256 */
#  define HRTIM_BMCR_BMPRSC_d512        (9 << HRTIM_BMCR_BMPRSC_SHIFT)  /* 1001: Division by 512 */
#  define HRTIM_BMCR_BMPRSC_d1024       (10 << HRTIM_BMCR_BMPRSC_SHIFT) /* 1010: Division by 1024 */
#  define HRTIM_BMCR_BMPRSC_d2048       (11 << HRTIM_BMCR_BMPRSC_SHIFT) /* 1011: Division by 2048 */
#  define HRTIM_BMCR_BMPRSC_d4096       (12 << HRTIM_BMCR_BMPRSC_SHIFT) /* 1100: Division by 4096 */
#  define HRTIM_BMCR_BMPRSC_d8192       (13 << HRTIM_BMCR_BMPRSC_SHIFT) /* 1101: Division by 8192 */
#  define HRTIM_BMCR_BMPRSC_d16384      (14 << HRTIM_BMCR_BMPRSC_SHIFT) /* 1110: Division by 16384 */
#  define HRTIM_BMCR_BMPRSC_d32769      (15 << HRTIM_BMCR_BMPRSC_SHIFT) /* 1111: Division by 32768 */
#define HRTIM_BMCR_BMPREN               (1 << 10)                       /* Bit 10: Burst Mode Preload Enable */
#define HRTIM_BMCR_MTBM                 (1 << 16)                       /* Bit 16: Master Timer Burst Mode */
#define HRTIM_BMCR_TABM                 (1 << 17)                       /* Bit 17: Timer A Burst Mode */
#define HRTIM_BMCR_TBBM                 (1 << 18)                       /* Bit 18: Timer B Burst Mode */
#define HRTIM_BMCR_TCBM                 (1 << 19)                       /* Bit 19: Timer C Burst Mode */
#define HRTIM_BMCR_TDBM                 (1 << 20)                       /* Bit 20: Timer D Burst Mode */
#define HRTIM_BMCR_TEBM                 (1 << 21)                       /* Bit 21: Timer E Burst Mode */
#define HRTIM_BMCR_BMSTAT               (1 << 31)                       /* Bit 31: Burst Mode Status */

/* Common Burst Mode Trigger Register */

#define HRTIM_BMTRGR_SW                 (1 << 0)  /* Bit 0: Software start  */
#define HRTIM_BMTRGR_MSTRST             (1 << 1)  /* Bit 1: Master reset or roll-over */
#define HRTIM_BMTRGR_MSTREP             (1 << 2)  /* Bit 2: Master repetition */
#define HRTIM_BMTRGR_MSTCMP1            (1 << 3)  /* Bit 3: Master Compare 1 */
#define HRTIM_BMTRGR_MSTCMP2            (1 << 4)  /* Bit 4: Master Compare 2 */
#define HRTIM_BMTRGR_MSTCMP3            (1 << 5)  /* Bit 5: Master Compare 3 */
#define HRTIM_BMTRGR_MSTCMP4            (1 << 6)  /* Bit 6: Master Compare 4 */
#define HRTIM_BMTRGR_TARST              (1 << 7)  /* Bit 7: Timer A reset or roll-over */
#define HRTIM_BMTRGR_TAREP              (1 << 8)  /* Bit 8: Timer A repetition */
#define HRTIM_BMTRGR_TACMP1             (1 << 9)  /* Bit 9: Timer A Compare 1 */
#define HRTIM_BMTRGR_TACMP2             (1 << 10) /* Bit 10: Timer A Compare 2 */
#define HRTIM_BMTRGR_TBRST              (1 << 11) /* Bit 11: Timer B reset or roll-over */
#define HRTIM_BMTRGR_TBREP              (1 << 12) /* Bit 12: Timer B repetition */
#define HRTIM_BMTRGR_TBCMP1             (1 << 13) /* Bit 13: Timer B Compare 1 */
#define HRTIM_BMTRGR_TBCMP2             (1 << 14) /* Bit 14: Timer B Compare 2 */
#define HRTIM_BMTRGR_TCRST              (1 << 15) /* Bit 15: Timer C reset or roll-over */
#define HRTIM_BMTRGR_TCREP              (1 << 16) /* Bit 16: Timer C repetition */
#define HRTIM_BMTRGR_TCCMP1             (1 << 17) /* Bit 17: Timer C Compare 1 */
#define HRTIM_BMTRGR_TCCMP2             (1 << 18) /* Bit 18: Timer C Compare 2 */
#define HRTIM_BMTRGR_TDRST              (1 << 19) /* Bit 19: Timer D reset or roll-over */
#define HRTIM_BMTRGR_TDREP              (1 << 20) /* Bit 20: Timer D repetition */
#define HRTIM_BMTRGR_TDCMP1             (1 << 21) /* Bit 21: Timer D Compare 1 */
#define HRTIM_BMTRGR_TDCMP2             (1 << 22) /* Bit 22: Timer D Compare 2 */
#define HRTIM_BMTRGR_TERST              (1 << 23) /* Bit 23: Timer E reset or roll-over */
#define HRTIM_BMTRGR_TEREP              (1 << 24) /* Bit 24: Timer E repetition */
#define HRTIM_BMTRGR_TECMP1             (1 << 25) /* Bit 25: Timer E Compare 1 */
#define HRTIM_BMTRGR_TECMP2             (1 << 26) /* Bit 26: Timer E Compare 2 */
#define HRTIM_BMTRGR_TAEEV7             (1 << 27) /* Bit 27: Timer A period following External Event 7 */
#define HRTIM_BMTRGR_TDEEV8             (1 << 28) /* Bit 28: Timer D period following External Event 8 */
#define HRTIM_BMTRGR_EEV7               (1 << 29) /* Bit 29: External Event 7 */
#define HRTIM_BMTRGR_EEV8               (1 << 30) /* Bit 30: External Event 8 */
#define HRTIM_BMTRGR_OCHPEV             (1 << 31) /* Bit 31: On-chip Event */

/* Common Burst Mode Compare Register */

#define HRTIM_BMCMPR_SHIFT              0         /* Bits 0-15: Burst mode compare value */
#define HRTIM_BMCMPR_MASK               (0xffff << HRTIM_BMCMPR_SHIFT)

/* Common Burst Mode Period Register */

